Revit 2024 API
MEPCurve.Width Property
The width of the MEP curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double Width { get; }
Visual Basic
Public ReadOnly Property Width As Double
	Get
Visual C++
public:
property double Width {
	double get ();
}
Remarks
This property is used to retrieve the width of the MEP curve.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the MEP curve's shape is not rectangular.
See Also
MEPCurve Class
Autodesk.Revit.DB Namespace